[
    {
        "quote": "Para tener éxito en la vida, tu deseo de vencer debe ser más grande que tu miedo a perder.",
        "person": "Bill Cosby"
    },
    {
        "quote": "Todo parece imposible hasta que se hace.",
        "person": "Nelson Mandela"
    },
    {
        "quote": "El 80% del éxito se basa simplemente en insistir.",
        "person": "Woody Allen"
    },
    {
        "quote": "Cuando alguien desea algo debe saber que corre riesgos y por eso la vida vale la pena.",
        "person": "Paulo Coelho"
    },
    {
        "quote": "El éxito es la suma de pequeños esfuerzos repetidos un día sí y otro también.",
        "person": "Robert Collier"
    },
    {
        "quote": "Da siempre lo mejor que tienes. Lo que plantes ahora, lo podrás cosechar más tarde.",
        "person": "Og Mandino"
    },
    {
        "quote": "La inteligencia sin ambición es como un pájaro sin sus alas.",
        "person": "Salvador Dalí"
    },
    {
        "quote": "El emprendedor siempre busca el cambio, responde a él y lo utiliza como oportunidad.",
        "person": "Peter Drucker"
    },
    {
        "quote": "El mañana es lo más importante en la vida. Llega a nosotros cada media noche como nuevo. Es perfecto cuando se pone en nuestras manos. En espera de que hayamos aprendido algo nuevo.",
        "person": "John Wayne"
    },
    {
        "quote": "Trabajar con amor es construir una casa con cariño, como si vuestro ser amado fuera a habitar en esa casa.",
        "person": "Khalil Gibran"
    },
    {
        "quote": "Si caes siete veces, levantate ocho.",
        "person": "Proverbio japonés"
    },
    {
        "quote": "Comienza haciendo lo que es necesario, después lo que es posible y de repente estarás haciendo lo imposible.",
        "person": "Francisco de Asís"
    },
    {
        "quote": "No importa lo despacio que vayas, siempre y cuando no te detengas.",
        "person": "Confucio"
    },
    {
        "quote": "Para ser un gran campeón, debes creer que eres el mejor. Si no lo eres, finge que lo eres.",
        "person": "Muhammad Ali"
    },
    {
        "quote": "Solo existen dos días al año en los que no se puede hacer nada, y son: ayer y mañana.",
        "person": "Dalai Lama"
    },
    {
        "quote": "No tienes que ser grande para empezar. No tienes que empezar para ser grande.",
        "person": "Zig Ziglar"
    },
    {
        "quote": "Nunca cruzarás el océano si no tienes el valor suficiente de perder de vista la costa.",
        "person": "Cristobal Colón"
    },
    {
        "quote": "Los dos días más importantes en tu vida son el día en el que naces y el día en el que descubres para qué.",
        "person": "Mark Twain"
    },
    {
        "quote": "El talento es más barato que la sal de mesa. Lo que separa al individuo talentoso del exitoso es un montón de trabajo duro.",
        "person": "Stephen King"
    }
]
