{
  "es": [
    {
      "id": "portfolio",
      "title": "Portafolio",
      "subtitle": "WebPage - 2025",
      "category": "proyectos",
      "description": "Este es mi portafolio personal, donde muestro mis proyectos, herramientas y experiencia. No es perfecto, tiene algunos bugs pero es funcional y está en constante mejora. Espero que te guste. PD: Estoy trabajando en la versión con backend para resolver los bugs actuales. <br> PD2: El bug más loco es al generar el CV, debes tener el scroll al máximo hacia arriba para que funcione correctamente, pues está usando una captura de pantalla en lugar de hacer el documento, (requiere backend).",
      "tags": [
        "HTML",
        "CSS",
        "JS",
        "Diseño"
      ],
      "images": {
        "desktop": "images/mockups/2.jpg",
        "mobile": "images/mockups/1.jpg"
      }
    },
    {
      "id": "dashboard-ventas",
      "title": "Dashboard de Ventas",
      "subtitle": "Power BI - 2024",
      "category": "trabajo",
      "description": "Dashboard interactivo para monitorear ventas, productos y zonas comerciales.",
      "tags": [
        "PowerBI",
        "DAX",
        "PostgreSQL"
      ],
      "images": {
        "desktop": "images/mockups/3.jpg",
        "mobile": "images/mockups/4.jpeg"
      }
    },
    {
      "id": "api-scraper_bcv",
      "title": "Buscador de tasa de BCV",
      "subtitle": "Web Scraping API - 2025",
      "category": "proyectos",
      "description":"Necesitaba una forma de obtener el tipo de cambio del BCV (para la conversión de USD a Bs) y poder usarlo en mis aplicaciones, proyectos o casos prácticos. Busqué si existía una API disponible para uso público, pero lamentablemente la única que encontré no era gratuita, así que creé la mía propia de la siguiente manera:<br><br> - Diseñé dos scrapers con BeautifulSoup: uno para datos históricos y otro que obtiene el tipo de cambio actual del BCV periódicamente mediante GitHub Actions.<br>- Creé una API con Flask, alojada en Railway.com con una base de datos PostgreSQL.<br>- Creé usuarios de servicio con roles para los scrapers y la API para interactuar de forma segura con la base de datos.<br>- Implementé endpoints de API para acceder a los datos, por ejemplo: <a target='_blank' href='https://tasabcv-production-3994.up.railway.app/api/tasa'>https://tasabcv-production-3994.up.railway.app/api/tasa</a> <br>Repositorio: <a target='_blank' href='https://github.com/hailtr/tasa_bcv'>https://github.com/hailtr/tasa_bcv</a>",
      "tags": [
        "Python",
        "Flask",
        "Web Scraping",
        "Railway",
        "PostgreSQL"
      ],
      "images": {
        "desktop": "images/mockups/5.jpg",
        "mobile": "images/mockups/6.jpg"
      }
    }
  ],
  "en": [
    {
      "id": "portfolio",
      "title": "Portfolio",
      "subtitle": "WebPage - 2025",
      "category": "projects",
      "description": "This is my personal portfolio where I showcase my projects, tools, and experience. It's not perfect, it has some bugs but it's functional and constantly improving. I hope you like it. PS: I'm working on the backend version to fix the current bugs. <br> PS2: The craziest bug is when generating the CV, you need to have the scroll all the way up for it to work correctly, as it's using a screenshot instead of making the document (requires backend).",
      "tags": [
        "HTML",
        "CSS",
        "JS",
        "Design"
      ],
      "images": {
        "desktop": "images/mockups/2.jpg",
        "mobile": "images/mockups/1.jpg"
      }
    },
    {
      "id": "dashboard-ventas",
      "title": "Sales Dashboard",
      "subtitle": "Power BI - 2024",
      "category": "work",
      "description": "Interactive dashboard for monitoring sales, products, and commercial zones.",
      "tags": [
        "PowerBI",
        "DAX",
        "PostgreSQL"
      ],
      "images": {
        "desktop": "images/mockups/3.jpg",
        "mobile": "images/mockups/4.jpeg"
      }
    },
    {
      "id": "api-scraper_bcv",
      "title": "BCV rate searcher",
      "subtitle": "Web Scraping API - 2025",
      "category": "proyectos",
      "description": "I needed a way to get the BCV rate (for USD to Bs conversions) and be able to use it in my applications, projects, or case studies. I looked into whether there was an API available for public use, but unfortunately the only one I found wasn't free, so I built my own as follows:<br><br> - I designed two scrapers using BeautifulSoup: one for historical data and one that fetches the current BCV rate periodically via GitHub Actions.<br>- I built an API using Flask, hosted on Railway.com with a PostgreSQL database.<br>- I created service users with roles for the scrapers and API to interact securely with the database.<br>- I implemented API endpoints to access the data, for example: https://tasabcv-production-3994.up.railway.app/api/tasa?fecha=2025-01-01 <br>Repository: <a target='_blank' href='https://github.com/hailtr/tasa_bcv'>https://github.com/hailtr/tasa_bcv</a>",
      "tags": [
        "Python",
        "Flask",
        "Web Scraping",
        "Railway",
        "PostgreSQL"
      ],
      "images": {
        "desktop": "images/mockups/5.jpg",
        "mobile": "images/mockups/6.jpg"
      }
    }
  ]
}